Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: (?^:pattern)
es: (?^:patrón)

source: (?{ local $cnt = $cnt + 1; # Update $cnt, # backtracking-safe.
es: (?{ local $cnt = $cnt + 1; # Actualiza $cnt, # independiente de vuelta atrás.

source: (?{ $cnt = 0 }) # Initialize $cnt.
es: (?{ $cnt = 0 }) # Inicializa $cnt.

source: (?{ $res = $cnt }) # On success copy to # non-localized location.
es: (?{ $res = $cnt }) # En caso de éxito, copia a # una ubicación no localizada

source: (?{print "hello"}) # print hello whenever this # branch is tried
es: (?{print "hola"}) # imprime hola cuando se # comprueba esta rama

source: (@foo,@bar,&SomeSub,%glarch)
es: (@foo,@bar,&AlgunaSub,%glarch)

source: (A module's main I<.pm> file may also load in other files in support of the module.)
es: (El archivo I<.pm> principal de un módulo también puede cargar otros archivos auxiliares del módulo).

source: (Actually Perl usually assumes the representation is ASCII; see L</Why do regex character classes sometimes match only in the ASCII range?> above.)
es: (En realidad, generalmente Perl supone que la representación es ASCII; vea la sección L</¿Por qué algunas veces las clases de caracteres de expresiones regulares solo detectan caracteres ASCII?> anterior).

source: (Also called "lazy" loading.)
es: (También se denomina carga "perezosa").

source: (Also known as L</static scoping>, because dictionaries don't change very fast.)
es: (También se conoce como L</control de ámbito estático>, ya que los diccionarios no se actualizan rápidamente).

source: (Also, sometimes refers to a group of command-line switches grouped into one L</switch cluster>.)
es: (También puede referirse a un grupo de modificadores de línea de comandos agrupados en un L</grupo de modificadores>).

source: (And you thought assigning the value was your primary intent in the first place!)
es: (Y usted que pensaba que su intención principal era asignar la variable...)

source: (As internal policy, you don't have to worry about it, unless you're into internals, or policy.)
es: (Como política interna, no tiene que preocuparse de esto, a menos que le interesen los componentes internos o la política).

source: (Assignments to C<$SIG{}>, however, assume the signal handler specified is in the C<main> package.
es: (sin embargo, las asignaciones a C<$SIG{}> suponen que el controlador de señal especificado está en el paquete C<main>;

source: (At one point C did also, but now it returns the name of the program.)
es: (Antes C también lo hacía, pero ahora devuelve el nombre del programa).

source: (But be aware that this means you can't have a separate C<@foo> and C<@bar>, etc.)
es: (pero tenga en cuenta que esto significa que no puede disponer de C<@foo> y C<@bar> independientes, etc.).

source: (But in practice, the distinction between code point and character is blurred, so the terms often are used interchangeably.)
es: En la práctica, la distinción entre los conceptos de código de carácter y carácter es difusa, por lo que se suelen utilizar ambos términos indistintamente.

source: (But not if it's morphing into another program via C<exec>, or being blown out of the water by a signal--you have to trap that yourself (if you can).)
es: (esto no ocurre si se transforma en otro programa mediante C<exec> o si se desencadena por una señal; el código debe encargarse de capturar esta señal, si es posible).

source: (But perhaps originally it was internally encoded as UTF-8, when you dumped it.)
es: (aunque la codificación interna de la cadena podría ser UTF-8 originalmente, cuando se volcó).

source: (But realize that what we are discussing the rules for just the I<storage> of these numbers.
es: (Pero no olvide que lo que estamos describiendo son solo las normas del I<almacenamiento> de estos números.

source: (But the empty C<package;> is no longer supported, as of version 5.10.)
es: (aunque desde la versión 5.10 se dejó de admitir la directiva C<package;> vacía).

source: (C<L<use locale ':not_characters'|perllocale/Unicode and UTF-8>> also sets the default to C</u>, overriding any plain C<use locale>.)
es: (C<L<use locale ':not_characters'|perllocale/Unicode and UTF-8>> también establece C</u> como predeterminado, anulando cualquier otro C<use locale>).

source: (C<MANPAGER> is not used if C<perldoc> was told to display plain text or unformatted pod.)
es: (no se usará C<MANPAGER> si se configuró C<perldoc> para mostrar texto simple o texto sin formato).

source: (C<and>, C<or> and C<not> aren't just in the above table as descriptions of the operators.
es: (En la tabla anterior C<and>, C<or> y C<not> no son solo descripciones de los operadores.

source: (Captured strings are also returned as a list in L</list context>.)
es: (Las cadenas capturadas también se devuelven como una lista en L</contexto de lista>).

source: (Compare L</lexical scoping>.)
es: (Compárese con el L</control de ámbito léxico>).

source: (Contrast with an L</assertion> that matches something of L</zero width> and may not be quantified.)
es: (Compare esta definición con la de L</aserción>, que detecta algo de L</ancho cero> y no se puede cuantificar).

source: (Don't forget to document your guess with a comment.)
es: (y no olvide agregar un comentario para documentar su conjetura).

source: (Don't worry about that C<< -> >> operator, it will be explained later.)
es: (No se preocupe por el operador C<< -> >>; se explicará más adelante).

source: (Has nothing to do with the L<kill|perlfunc/kill> built-in, unless you're trying to run a L</signal handler>.)
es: (No tiene nada que ver con la función predefinida L<kill|perlfunc/kill>, a menos que intente ejecutar un L</controlador de señales>).

source: (Header files have been superseded by the L</module> mechanism.)
es: (Los archivos de encabezado han sido reemplazados por el mecanismo de L<módulos|/módulo>).

source: (I<"Rounding to zero".>)
es: (I<"Redondeo a cero">)

source: (I<Loss of information>)
es: (I<Pérdida de información>)

source: (If C<use locale> is set, then this depends on the current locale.)
es: (Si se habilita C<use locale>, esto dependerá de la configuración regional actual).

source: (If a curly bracket occurs in any other context and does not form part of a backslashed sequence like C<\x{...}>, it is treated as a regular character.
es: (Si aparece una llave en cualquier otro contexto y no forma parte de una secuencia marcada con un carácter de escape, como en C<\x{...}>, se tratará como un carácter normal.

source: (If it's any comfort, when your interpreter exits, a "real" garbage collector runs to make sure everything is cleaned up if you've been messy with circular references and such.)
es: (Puede estar tranquilo, cuando finaliza la ejecución del intérprete se ejecuta un recolector de elementos no deseados "real" para garantizar que todo quede limpio si se ha desordenado con referencias circulares, etc.).

source: (If it's text data.)
es: (si son datos de tipo texto).

source: (If you do see an error message, it's still possible you have the module, but that it's not in your path, which you can display with C<perl -e "print qq(@INC)">.)
es: Si ve un mensaje de error, puede ser que el módulo esté instalado pero no esté en la ruta (que puede ver ejecutando C<perl -e "print qq(@INC)">).

source: (In a script passed to Perl via B<-e> switches, each B<-e> is counted as one line.)
es: (En un script pasado a Perl a través de modificadores B<-e>, cada B<-e> cuenta como una línea).

source: (In addition, if running under HP-UX, C<col -x> will be used.)
es: (en HP-UX se usa además C<col -x>).

source: (In fact, all packets are sent independently at the L</IP> level, but L</stream> protocols such as L</TCP> hide this from your program.)
es: (De hecho, todos los paquetes se envían de forma independiente en el nivel L</IP>, pero los protocolos de envío de L<secuencias|/secuencia> como L</TCP> ocultan esto a los programas).

source: (In other words, names beginning with $ or @, followed by an optional bracketed expression as a subscript.)
es: (es decir, los nombres que empiezan por $ o @, seguidos de una expresión opcional de subíndice entre corchetes).

source: (It used to do so in Perl 4, but we had to break this to make sure destructors were called when expected.)
es: (esto se hacía en Perl 4, pero tuvimos que suprimir esta característica para asegurarnos de que se llamara a los destructores en el momento esperado).

source: (It's possible to do things with named capture groups that would otherwise require C<(??{})>.)
es: (Así, es posible hacer cosas con los grupos de captura con nombres que, de otro modo, requerirían código C<(??{})>).

source: (LIST)
es: (LISTA)

source: (Language historians will also note some vestiges of B<csh>, Pascal, and even BASIC-PLUS.)
es: (los historiadores de los lenguajes también destacarán algunos vestigios de B<csh>, Pascal e incluso BASIC-PLUS).

source: (Leaving it open leaks filehandles if the module is reloaded for any reason, so it's a safer practice to close it.)
es: (Si se deja abierto el identificador de archivo, provoca una pérdida de identificadores de archivos en caso de que se vuelva a cargar el módulo por alguna razón, así que es recomendable cerrarlo).

source: (Most of these one character names have a predefined significance to Perl.
es: (la mayor parte de estos nombres de un solo carácter tienen un significado predefinido para Perl;

source: (Not to be confused with L</overloading>, which adds definitions that must be disambiguated some other way.)
es: (No se debe confundir con L</sobrecargar>, que consiste en agregar definiciones que hay que desambiguar de alguna manera alternativa).

source: (Note that this is not true of lists, which return the last value, like the C comma operator, nor of built-in functions, which return whatever they feel like returning.)
es: (tenga en cuenta que esto no es cierto para las listas, que devuelven el último valor, como el operador coma de C; tampoco es cierto para las funciones predefinidas, que devuelven lo que les parezca mejor devolver).

source: (Note that this utility requires the C<Text::Diff> module to function properly; this module isn't distributed with perl, but is available from the CPAN.)
es: (Tenga en cuenta que esta utilidad requiere el módulo C<Text::Diff> para funcionar correctamente; este módulo no se distribuye con perl, pero está disponible en CPAN).

source: (Older programs did this by setting C<$*>, but this option was removed in perl 5.9.)
es: (En los programas antiguos se hacía por medio de C<$*>, pero esta opción se eliminó en perl 5.9).

source: (Or don't parse, as the case may be.)
es: (O que no se analizan, si fuera el caso).

source: (Or, at least, more fun.)
es: (O, al menos, más divertida).

source: (Otherwise Perl considers their meanings to be undefined.)
es: (De lo contrario, Perl considerará que no están definidos).

source: (Perl also has more complicated names, such as L</qualified> names.)
es: (Es posible usar nombres más complicados en Perl, como los L<nombres completos|/nombre completo>).

source: (Pushing unannotated tags is not allowed.)
es: (No se permite insertar etiquetas sin anotaciones).

source: (Remember that if you do this, you'll have to put C<use lib "/my/perl_directory";> near the top of the program that is to use this module.
es: (Recuerde que si hace esto, tendrá que agregar C<use lib "/mi/directorio_perl";> cerca del principio de los programas que utilicen este módulo).

source: (Replace "Foo" with the name of the module; for instance, C<perl -MCGI::Carp -e 1>.
es: (reemplace "Foo" por el nombre del módulo; por ejemplo, C<perl -MCGI::Carp -e 1>).

source: (See L</indirection>.)
es: (Vea L</direccionamiento indirecto>).

source: (See L<perlfaq2/What modules and extensions are available for Perl?
es: (Vea L<perlfaq2/¿Qué módulos y extensiones están disponibles para Perl?

source: (See L<perlsyn/"Compound Statements">.)
es: (Vea L<perlsyn/"Instrucciones compuestas">).

source: (See also the L<AutoSplit> module, which has nothing to do with the B<-a> switch, but a lot to do with autoloading.)
es: (Vea también el módulo L<AutoSplit>, que no tiene nada que ver con el modificador B<-a>, pero está muy relacionado con la carga automática).

source: (See also L</inheritance> and L</multiple inheritance>.)
es: (Vea también L</herencia> y L</herencia múltiple>).

source: (See also L</inheritance>, and L</single inheritance>.)
es: (Vea también L</herencia> y L</herencia simple>.)

source: (See also L</memory>.)
es: (Vea también L</memoria>.)

source: (So if C<textsize> expects an integer, and you do C<-w textsize:big>, expect trouble.)
es: (si C<textsize> espera un entero y se especifica C<-w textsize:big>, lo más seguro es que se produzca un error).

source: (Some hard references are held internally, such as the implicit reference from one of a L</typeglob>'s variable slots to its corresponding referent.)
es: (Algunas referencias estrictas se guardan internamente, como la referencia implícita de las vacantes de variable de un L</typeglob> a su referencia correspondiente).

source: (Some operating system distributions may ship the documentation in a different package; for instance, on Debian, you need to install the C<perl-doc> package.)
es: (Las distribuciones para algunos sistemas operativos pueden incluir la documentación en un paquete distinto; por ejemplo, en Debian, debe instalar el paquete C<perl-doc>).

source: (Some platforms do not have a concept of a home directory.)
es: (En algunas plataformas no existe el concepto de directorio principal).

source: (That C<-a> tells git to add every file you've changed to this commit.
es: (El modificador C<-a> indica a git que debe agregar todos los archivos modificados a esta confirmación.

source: (The L<our|perlfunc/our> declaration declares a lexically scoped name for a global variable, which is not itself a lexical variable.)
es: (La declaración L<our|perlfunc/our> declara un nombre de ámbito léxico para una variable global, que no es una variable léxica).

source: (The following all specify the same class of three characters: C<[-az]>, C<[az-]>, and C<[a\-z]>.
es: (Los siguientes ejemplos especifican la misma clase de tres caracteres: C<[-az]>, C<[az-]> y C>[a\-z]>.

source: (The "standard" of standard I/O is only marginally related to the "standard" of standard input and output.)
es: (La palabra "estándar" de E/S estándar solo tiene una relación tangencial con el estándar de entrada y salida).

source: (The C<v> is optional when there are at least three integers.)
es: (La C<v> es opcional si hay al menos tres enteros.)

source: (The binmode is needed because otherwise Perl may convert line endings on Win32 systems.)
es: (la función binmode es necesaria para evitar que, en sistemas Win32, Perl convierta los caracteres de fin de línea).

source: (The code block itself can use C, etc., to refer to the enclosing pattern's capture groups.)
es: (El bloque de código puede utilizar C, etc., para hacer referencia a grupos de captura del patrón que lo contiene).

source: (The difference between these two constructs is that the second one uses a capturing group, thus shifting ordinals of backreferences in the rest of a regular expression.)
es: (La diferencia entre estas dos construcciones es que la segunda utiliza un grupo de captura, por lo que incrementa el número de las retrorreferencias en el resto de la expresión regular).

source: (The first occurrence of "a" restricts the C<\d>, etc., and the second occurrence adds the C</i> restrictions.)
es: (La primera "a" restringe C<\d>, etc. y la segunda agrega restricciones a C</i>).

source: (The latter is so that embedded pods for executables, such as C<perldoc> itself, are available.)
es: (esta última hace que esté disponible la documentación pod incluida en ejecutables, como C<perldoc>).

source: (The routines are derived (distantly) from Henry Spencer's freely redistributable reimplementation of the V8 routines.)
es: (Las rutinas se derivan lejanamente de la reimplementación redistribuible de las rutinas V8 realizada por Henry Spencer).

source: (The slot is distinguished by the absence of a comma between it and the next argument.)
es: (La vacante se distingue por la ausencia de una coma entre ella y el siguiente argumento).

source: (The term "Pieces of Eight" comes from being able to split the old Spanish dollar into 8 bits, each of which still counted for money.
es: En inglés, el término "Pieces of Eight" (partes de ocho) viene de la posibilidad de dividir el antiguo dólar español en 8 partes, cada una de las cuales se podía usar como dinero.

source: (Their position I<does> change their meanings.)
es: (Su posición I<cambia> su significado).

source: (These used to live in t/op).
es: (antes estaban en t/op).

source: (This can happen if the group is optional, or in a different branch of an alternation.)
es: (Esto puede ocurrir si el grupo es opcional o está en una rama diferente de la alternancia).

source: (This doesn't apply to sysread() and syswrite().)
es: (esto no se aplica a sysread() ni a syswrite()).

source: (This doesn't mean that more ways are always better or that all possible paths are equally desirable--just that there need not be One True Way.)
es: (Esto no significa que siempre sea mejor tener más maneras de hacer algo ni que todas las maneras posibles sean igualmente deseables, sino simplemente que no tiene que haber una única manera de hacer las cosas).

source: (This is important only if C<S> has capturing parentheses, and backreferences are used somewhere else in the whole regular expression.)
es: (Esto solo es importante si C<S> tiene paréntesis de captura y las retrorreferencias se usan en otra parte de la expresión regular).

source: (This is one of the requirements of C<use strict;>.)
es: (Éste es uno de los requisitos de C<use strict;>).

source: (This might not seem important, but it is important when you are capturing matched text using parentheses.)
es: (Esto puede no parecer importante, pero lo es cuando se está capturando texto con paréntesis).

source: (This start line assumes you have the B<env> program.
es: (En esta línea se supone que dispone del programa B<env>.

source: (To avoid this cost while retaining the grouping behaviour, use the extended regular expression C<(?: ... )> instead.)
es: (Para evitar este coste y conservar el comportamiento de agrupación, se debe usar en su lugar la expresión regular extendida C<(?: ... )>).

source: (To be compatible with .Net regular expressions, C<\g{I<name>}> may also be written as C<\k{I<name>}>, C<\kE<lt>I<name>E<gt>> or C<\k'I<name>'>.)
es: (Por compatibilidad con las expresiones regulares de .NET, C<\g{I<nombre>}> también se puede escribir como C<\k{I<nombre>}>, C<\kE<lt>I<nombre>E<gt>> o C<\k'I<nombre>'>).

source: (Unfortunately, everything is relatively stable compared to something else, except for certain elementary particles, and we're not so sure about them.)
es: (Por desgracia, todo es relativamente estable en comparación con otra cosa, salvo algunas partículas elementales, y en este caso tampoco tenemos la seguridad).

source: (Usually.)
es: (Casi siempre).

source: (We avoid use of this term to mean L</variable interpolation>.)
es: (Evitamos usar este término para designar la L</interpolación de variables>).

source: (Well, actually, people first switched to C because they found lowercase identifiers easier to read than upper.)
es: (En realidad, los programadores se pasaron a C porque les gustaban más los identificadores en minúsculas que en mayúsculas).

source: (When it's not some other encoding.)
es: (cuando no es otra codificación).

source: (Which is why they're reserved, after all.)
es: (Por eso se llaman reservadas).

source: (Why do we have separate numeric and string comparisons?
es: ¿Por qué se usa un operador de comparación para números y otro para cadenas?

source: (Within character classes C<\b> represents backspace rather than a word boundary, just as it normally does in any double-quoted string.)
es: (Dentro de una clase de caracteres, C<\b> representa el retroceso (I<backspace>) en lugar del límite de palabra, tal como lo hace normalmente en cualquier cadena escrita entre comillas dobles).

source: (XXX: needs explanation).
es: (XXX: necesita una explicación).

source: (Yes, this really can make a difference.)
es: (Sí, esto realmente puede suponer una diferencia).

source: (contributed by brian d foy)
es: (contribución de brian d foy)

source: (foo|bar|baz) matches any of the alternatives specified
es: (foo|bar|baz) cualquiera de las alternativas especificadas

source: (for 1-5.005_56) or **/*.t (for 5.6.0-5.7.3)
es: (para 1-5.005_56) o **/*.t (para 5.6.0-5.7.3)

source: )* # any number of times
es: )* # cualquier número de veces

source: * zero or more of the previous thing
es: * cero o más coincidencias de lo anterior

source: * Match 0 or more times
es: * 0 o más veces

source: * multiplication
es: * multiplicación

source: * / % x SYNTAX
es: * / % x SINTAXIS

source: *+ Match 0 or more times and give nothing back
es: *+ 0 o más veces sin devolver nada

source: *dick = *richard;
es: *bea = *beatriz;

source: *dick = \$richard;
es: *bea = \$beatriz;

source: *foo = \$bar; # Make $foo an alias for $bar
es: *foo = \$bar; # Hace que $foo sea un alias de $bar

source: *some_hash = fn( \%another_hash );
es: *mi_hash = fn( \%otro_hash );

source: *this = *that;
es: *este = *ese;

source: + one or more of the previous thing
es: + una o más coincidencias de lo anterior

source: + Match 1 or more times
es: + 1 o más veces

source: + addition
es: + suma

source: + - . foreach (LIST) { } for (a;b;c) { }
es: + - . foreach (LISTA) { } for (a;b;c) { }

source: ++ Match 1 or more times and give nothing back
es: ++ 1 o más veces sin devolver nada

source: , => {3,7} repeat in range /a ASCII /aa safe
es: , => {3,7} repeticiones en rango /a ASCII /aa seguro

source: - subtraction
es: - resta

source: --Ant.
es: --Antónimo.

source: --Syn.
es: --Sinónimo.

source: --author="Your Name" --email=yourname@cpan.org
es: --author="Su nombre" --email=sunombre@cpan.org

source: -D## (?!p) ZW neg ahead \s whitespace
es: -D## (?!p) inspec. neg delante \s espacio en blanco

source: -MO=Deparse (?#t) comment REGEX CHARCLASSES
es: -MO=Deparse (?#t) comentario CLASES CARACTERES EXP. REG.

# -MO=Terse (?=p) ZW pos ahead . [^ ]
source: -MO=Terse (?=p) ZW pos ahead . [^\n]
es: -MO=Terse (?=p) inspec. pos. delante . [^\n]

source: -d:Trace (?<=p) ZW pos behind \K \w word chars (?<!p) ZW neg behind \d digits
es: -d:Trace (?<=p) inspec. pos. atrás \K \w caracteres palabra (?<!p) inspec. neg. atrás \d dígitos

source: . a single character
es: . un solo carácter

source: . Match any character (except newline)
es: . Cualquier carácter (excepto el de nueva línea)

source: . string concatenation
es: . concatenación de cadenas

# ... + one or more /s . includes
source: ... + one or more /s . includes \n
es: ... + una o más /s . incluir \n

source: ... and run the script as C</path/to/script.pl>.
es: ... y ejecutar el script como C</ruta/script.pl>.

source: ... except inside quoted strings:
es: ... salvo cuando está entre comillas:

source: .23E-10 # a very small number
es: .23E-10 # un número muy pequeño

source: / (Y) # group 1 ( # group 2 (X) # group 3 \g{-1} # backref to group 3 \g{-3} # backref to group 1 )
es: / (Y) # grupo 1 ( # grupo 2 (X) # grupo 3 \g{-1} # retrorreferencia a grupo 3 \g{-3} # retrorreferencia a grupo 1 )

source: / division
es: / división

source: /$unquoted\Q$quoted\E$unquoted/
es: /$activados\Q$desactivados\E$activados/

source: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\010/ # \010 is octal
es: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\010/ # \010 es octal

source: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\10/ # \10 is a backreference
es: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\10/ # \10 es una retrorreferencia
